In [3]:
import pandas as pd


data = {
    'key':['A', 'B', 'C', 'C', 'A', 'B', 'A'],
    'val':[15,25,26,37,26,123,12]
}
df = pd.DataFrame(data)
df

  key  val
0   A   15
1   B   25
2   C   26
3   C   37
4   A   26
5   B  123
6   A   12

In [5]:
df.groupby('key').sum()

     val
key
A     53
B    148
C     63

In [6]:
df.groupby('key').mean()

           val
key
A    17.666667
B    74.000000
C    31.500000

In [7]:
df = pd.read_csv('./data/titanic.csv')

In [8]:
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [9]:
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64